package JFx_prac;

public class Dog implements Animal {
	public String info() {
		return "분류 : 동물계-척삭동물문-포유강-식육목-갯과-개속-늑대 (아종 : 개)\n"
				+ "수명 : 10 ~ 15년\n"
				+ "개요 : 식육목 갯과(Canidae) 개속(Canis)의 늑대(Canis lupus)[10] 가운데\n"
				+ "특히 야생성이 적고 인간에게 친숙한 아종(C. lupus familiaris)을 이르는 말.\n"
				+ "아종명 familiaris는 '사육되는'이라는 뜻으로,\n"
				+ "닭의 아종명 domesticus처럼 길들여진 동물 종들에게 으레 붙는 학명이다.\n"
				+ "\n"
				+ "생물학적으로는 늑대와 완전히 같은 종이다.\n"
				+ "간혹 개의 조상이 늑대라고 인식하는 경우도 있는데, 이는 틀린 개념이다.\n"
				+ "개와 늑대는 동시대를 살아가는 동물이기 때문이다.\n"
				+ "다시 말해 개와 늑대는 본질적으로 종이 동일하며,\n"
				+ "그저 인간의 언어 체계에서만 분리된 개념으로 받아들일 뿐이다.\n"
				+ "종이 같으니 어느 하나가 다른 하나의 조상도 아니다.\n"
				+ "아울러 생물학적으로 동일한 종이므로 같은 조상에서 '갈라져 나온' 동물도 아니다.\n"
				+ "\n"
				+ "개와 늑대의 유전적 차이는 불과 0.04% 미만[11]에 불과한데,\n"
				+ "인간의 인종간 유전적 차이인 0.1%보다도 적은 수치다. \n"
				+ "다시 말해 개와 늑대는 백인과 황인보다도 유전적으로 더 가깝다. \n"
				+ "개가 인류와 함께 하게 된 것은 계통 전체의 역사에 비하면 극히 찰나의 순간에 불과하기 때문에 \n"
				+ "늑대로부터 독립된 종으로는 분화하기에는 턱없이 이른 시간이다.";
	}
}
